app/views/home/index.html.erb

SELECT `photos`.* FROM `photos` WHERE `photos`.`product_id` = 1
---
  <div class="product-img">
    <% Photo.where(product_id: p).collect do|img| %>

SELECT  `brands`.* FROM `brands` WHERE `brands`.`id` = NULL LIMIT 1
---
  <div class="product-title">
    <% @b = Brand.find(p.brand_id) %>