app/views/carts/show.html.erb

SELECT `cartitems`.* FROM `cartitems` WHERE `cartitems`.`cart_id` = 4
SELECT `photos`.* FROM `photos` WHERE `photos`.`product_id` = 2
---

		<% @cart.cartitem.collect do |item| %>
			<td> <% Photo.where(product_id: item.product_id).collect {|img|