app/controllers/carts_controller.rb

	def create
		@cart = Cart.new
		@cartitms = Cartitem.new
		@product = Product.find(params[:format])
		@cartitms.product_id = @product.id
		@q = @product.quantity
		@cartitms.price = @q.selling_price
		@cartitms.qty = 1
		@cart = Cart.find_by(user_id: current_user.id)
		if @cart.present?
			puts 'in if ************'
		else
			@cart = Cart.new
			@cart.user_id = current_user.id
			@cart.save
		end
		@cartitms.cart_id = @cart.id
		@cartitms.save
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = NULL LIMIT 1
SELECT  `carts`.* FROM `carts` WHERE `carts`.`user_id` = 3 LIMIT 1
INSERT INTO `carts` (`userid`, `productid`, `price`, `quantity`, `created_at`, `updated_at`) VALUES (3, 2, 40000.0, 1, '2017-08-31 06:37:32', '2017-08-31 06:37:32')
INSERT INTO `cartitems` (`cart_id`, `product_id`, `price`, `qty`, `created_at`, `updated_at`) VALUES (2, 2, 40000.0, 1, '2017-09-01 08:06:04', '2017-09-01 08:06:04')

	def show
		puts '***********'
		@cart = Cart.where(userid: current_user.id)
		 @cart.cartitems.collect {|p| puts p.product_id	 }
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 3
SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 3 LIMIT 1
SELECT  `products`.* FROM `products` WHERE `products`.`id` = NULL LIMIT 1
SELECT `cartitems`.* FROM `cartitems` WHERE `cartitems`.`cart_id` IN (SELECT `carts`.`id` FROM `carts` WHERE `carts`.`user_id` = 3)