app/controllers/products_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 6 LIMIT 1
---
def show
	@product = Product.find(params[:id])