app/controllers/registration_controller.rb

def create
@user =User.new(user_params)
@userinformation = @user.userinformation.create(user_params)
---
INSERT INTO "userinformations" ("user_id", "name", "mobileno", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["name", "maya"], ["mobileno", 1234567890], ["created_at", "2017-08-12 11:37:13.671062"], ["updated_at", "2017-08-12 11:37:13.671062"]]
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('vc@g.com', '$2a$11$q9ct/KTJZyICs4WcA0FyzeCAy/t0ec5H/m7oNNTAi3CStxkBsE4la', '2017-08-15 12:42:34', '2017-08-15 12:42:34')