app/views/products/show.html.erb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 6 LIMIT 1
---
	 <div class = "part">
	 	<% Product.where(id: @product.id).collect do |p| %>

SELECT `photos`.* FROM `photos` WHERE `photos`.`product_id` IS NULL
---
	<div class="product-img">
		<% Photo.where(product_id: @product.id).collect do|img| %>

SELECT  `brands`.* FROM `brands` WHERE `brands`.`id` = 3 LIMIT 1
---
		<div class="product-title"><%= @product.name =%>
			<% @b = Brand.find(@product.brand_id) %>